In [3]:
import numpy as np
import pandas as pd

In [7]:
frame = pd.DataFrame([[1,6.5,None],[1,None,None],
                     [None,None,None],[6.5,3,None]])
cleaned = frame.dropna()

frame

     0    1     2
0  1.0  6.5  None
1  1.0  NaN  None
2  NaN  NaN  None
3  6.5  3.0  None

In [8]:
cleaned

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [11]:
data_1 = frame.dropna(how='all',axis=0)#丢弃全为空值的行
data_1

     0    1     2
0  1.0  6.5  None
1  1.0  NaN  None
3  6.5  3.0  None

In [12]:
data_2 = frame.dropna(how='all',axis=1)#丢弃全为空值的列
data_2

     0    1
0  1.0  6.5
1  1.0  NaN
2  NaN  NaN
3  6.5  3.0

In [13]:
data_3  = frame.dropna(thresh=2)
data_3

     0    1     2
0  1.0  6.5  None
3  6.5  3.0  None

In [14]:
# 填充缺失值
frame.fillna(0)

     0    1  2
0  1.0  6.5  0
1  1.0  0.0  0
2  0.0  0.0  0
3  6.5  3.0  0

In [15]:
frame.fillna({0:0,1:1,2:2})

     0    1  2
0  1.0  6.5  2
1  1.0  1.0  2
2  0.0  1.0  2
3  6.5  3.0  2

In [16]:
frame = pd.DataFrame({
    'C1':['one','two']*2+['two'],
    'C2':[1,1,2,3,3]
})

frame

    C1  C2
0  one   1
1  two   1
2  one   2
3  two   3
4  two   3

In [17]:
frame.drop_duplicates(['C1'])

    C1  C2
0  one   1
1  two   1

In [18]:
frame = pd.DataFrame({
    'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
    'ounces':[4,3,12,6,7.5,8,3,5,6]
})
frame

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat2animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}